Repository: dell/libsmbios
Catalog: po/*.po
Languages: ka

source: Supported Keyboard light brightness levels :
ka: კლავიატურის განათების სიკაშკაშის მხარდაჭერილი დონეები :

source: Maximum acceptable seconds timeout value :
ka: მოლოდინის მაქსიმალური მისაღები მნიშვნელობა წამებში :

source: Maximum acceptable minutes timeout value :
ka: მოლოდინის მაქსიმალური მისაღები მნიშვნელობა წუთებში :

source: Maximum acceptable hours timeout value :
ka: მოლოდინის მაქსიმალური მისაღები მნიშვნელობა საათებში :

source: Maximum acceptable days timeout value :
ka: მოლოდინის მაქსიმალური მისაღები მნიშვნელობა დღეებში :

source: Error Return Code: cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X cbRES4: 0x%X
ka: დაბრუნებული შეცდომის კოდი: cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X cbRES4: 0x%X

source: Get Ambient Light Sensor(ALS) Status: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
ka: გარე განათების სენსორის (ALS) სტატუსის მიღება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Unable to get ALS settings: Feature Not supported on this system
ka: ALS-ის პარამეტრების მიღების შეცდომა: ამ სისტემას ეს ფუნქცია არ გააჩნია

source: Get Ambient Light Sensor(ALS) Brightness Table: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
ka: გარე განათების სენსორის (ALS) სიკაშკაშის ცხრილის მიღება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Unable to get ALS Brightness Table: Feature Not supported on this system
ka: ALS-ის სიკაშკაშის ცხრილის მიღების შეცდომა: ამ სისტემას ეს ფუნქცია არ გააჩნია

source: ALS high/low limit: %d
ka: ALS დაბალი/მაღალი ზღვარი: %d

source: Invalid parm_str detected
ka: აღმოჩენილია არასწორი parm_str

source: Set Ambient Light Sensor(ALS) Status: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
ka: გარე განათების სენსორის (ALS) სტატუსის დაყენება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Unable to Set ALS settings
ka: ALS -ის პარამეტრების დაყენების შეცდომა

source: smbios-keyboard-ctl version : %s
ka: smbios-keyboard-ctl -ის ვერსია : %s

source: Helper function to print current status of keyboard illumination
ka: დამხმარე ფუნქცია კლავიატურის განათების მიმდინარე სტატუსის გამოსატანად

source: Setting USER Selectable Keyboard Mode
ka: კლავიატურის მომხმარებლის მიერ არჩევადი რეჟიმის დაყენება

source: Setting Keyboard illumination Triggers
ka: კლავიატურის განათების ტრიგერების დაყენება

source: This will Display the Supported Features of USTT and AAC
ka: ეს USTT-ის და AAC-ის მხარდაჭერილ ფუნქციებს გაჩვენებთ

source: This will Display the Thermal Information of a system
ka: ეს სისტემის თერმულ ინფორმაციას გაჩვენებთ

source: Option to set Thermal Mode; balanced, cool-bottom, quiet, performance
ka: თერმალის რეჟიმის პარამეტრის ვარიანტები: balanced (გაწონასწორებული), cool-bottom (გრილი), quiet (ჩუმი), performance (წარმადობა)

source: Print all the Available Thermal Information of your system:
ka: თქვენს სისტემაზე ხელმისაწვდომი თერმალის ინფორმაციის გამოტანა:

source: Get Thermal Information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X, res[smi.cbRES3]=0x%X
ka: თერმალის ინფორმაციის მიღება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X, res[smi.cbRES3]=0x%X

source: Info: Unable to Get Thermal Information on this system
ka: ინფორმაცია: ამ სისტემაზე თერმალის ინფორმაციის მიღება შეუძლებელია

source: Supported Active Acoustic Controller (AAC) modes:
ka: აქტიური აკუსტიკური კონტროლერის (AAC) მხარდაჭერილი რეჟიმები:

source: Supported AAC Configuration type:
ka: AAC-ის კონფიგურაცის მხარდაჭერილი ტიპი:

source: Get Thermal Information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
ka: თერმალის ინფორმაციის მიღება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Print Current Status of Thermal Information:
ka: თერმალის ინფორმაციის მიმდინარე სტატუსის გამოტანა:

source: Current Thermal Modes:
ka: ტემპერატურის მიმდინარე რეჟიმები:

source: Current Active Acoustic Controller (AAC) Mode:
ka: აქტიური აკუსტიკური კონტროლერის (AAC) მიმდინარე რეჟიმი:

source: Current Fan Failure Mode:
ka: ვენტილატორის ავარიის მიმდინარე რეჟიმი:

source: Selected Thermal Mode = %s
ka: ტემპერატურის კონტროლის მიმდინარე რეჟიმი = %s

source: Invalid thermal mode option specified: %s, Supported modes : balanced, cool-bottom, quiet, performance
ka: მითითებულია თერმალის არასწორი პარამეტრი: %s, მხარდაჭერილი რეჟიმებია: balanced(დაბალანსებული), cool-bottom (გრილი), quiet (ჩუმი), performance (წარმადობა)

source: Set Thermal Information: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
ka: თერმალის ინფორმაციის დაყენება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Set Thermal Information failed: arg2- %x cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X
ka: თერმალის ინფორმაციის დაყენების შეცდომა: arg2- %x cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X

source: Thermal Information Set successfully to: %s
ka: თერმალის ინფორმაციის დაყენება წარმატებულია: %s

source: smbios-thermal-ctl version : %s
ka: smbios-thermal-ctl -ის ვერსია : %s

source: You can use smbios-thermal-ctl utlity to control the fan speed
ka: ვენტილატორების სიჩქარის სამართავად პროგრამა smbios-thermal-ctl შეგიძლიათ გამოიყენოთ

source: Helper function to Get current Thermal Mode settings
ka: დამხმარე ფუნქცია თერმალის რეჟიმის მიმდინარე პარამეტრების მისაღებად

source: Helper function to Set Thermal Mode
ka: დამხმარე ფუნქცია თერმალის რეჟიმის დასაყენებლად

source: Debug: Memory dump file to use instead of physical memory
ka: გამართვა: ფიზიკური მეხსიერების ნაცვლად მეხსიერების დამპი იქნება გამოყენებული

source: Debug: CMOS dump file to use instead of physical cmos
ka: გამართვა: ფიზიკური CMOS-ის ნაცვლად CMOS-იშ დამპის ფაილი იქნება გამოყენებული

source: Set Boot To UP Flag to true
ka: Boot to UP ალმის ჩართვა

source: Set Boot To UP Flag to false
ka: Boot to UP ალმის გამორთვა

source: Display libsmbios version information
ka: Libsmbios -ის ვერსიის ინფორმაციის ჩვენება

source: UP Boot Flag SET
ka: UP Boot ალმის ჩართვა

source: UP Boot Flag NOT SET
ka: UP Boot ალამი დაყენებული არა

source: Dumping CMOS index(%d) data(%d)
ka: CMOS -ის ინდექსის დამპი(%d) მონაცემი(%d)

source: error opening dump file "%s": %m
ka: დამპის ფაილის გახსნის შეცდომა "%s": %m

source: could not allocate memory: %m
ka: მეხსიერების გამოყოფის შეცდომა: %m

source: could not read from memory: %m
ka: მეხსიერებიდან წაკითხვის შეცდომა: %m

source: could not write to "%s": %m
ka: "%s"-ში ჩაწერის შეცდომა: %m

source: OEM String %d: %s
ka: OEM -ის სტრიქონი %d: %s

source: System ID: 0x%04X
ka: სისტემის ID: 0x%04X

source: Error getting the System ID: unknown error.
ka: სისტემის ID-ის მიღების შეცდომა: უცნობი შეცდომა.

source: OEM System ID: 0x%04X
ka: OEM -ის სისტემის ID: 0x%04X

source: Service Tag: %s
ka: სერვისული ჭდე: %s

source: Express Service Code: %lld
ka: ექსპრეს-სერვისის ჭდე: %lld

source: Error getting the Service Tag: unknown error
ka: სერვისული ჭდის მიღების შეცდომა: უცნობი შეცდომა.

source: Asset Tag: %s
ka: აქტივის ჭდე: %s

source: Error getting the Asset Tag: unknown error
ka: აქტივის ჭდის მიღების შეცდომა: უცნობი შეცდომა.

source: Product Name: %s
ka: პროდუქტის სახელი: %s

source: Error getting the System Name: unknown error.
ka: სისტემის სახელის მიღების შეცდომა: უცნობი შეცდომა.

source: BIOS Version: %s
ka: BIOS -ის ვერსია: %s

source: Error getting the BIOS Version: unknown error.
ka: BIOS-ის ვერსიის სახელის მიღების შეცდომა: უცნობი შეცდომა.

source: Vendor: %s
ka: მომწოდებელი: %s

source: Error getting the Vendor: unknown error.
ka: მომწოდებლის მიღების შეცდომა: უცნობი შეცდომა.

source: Is Dell: %d
ka: არის თუ არა Dell: %d

source: Set CMOS state byte to new value
ka: CMOS-ის მდგომარეობის ბაიტის ახალი მნიშვნელობის დაყენება

source: Set state byte owner
ka: მდგომარეობის ბაიტის მფლობელის დაყენება

source: State Byte: 0x%04x
ka: მდგომარეობის ბაიტი: 0x%04x

source: There was an allocation failure while trying to construct the cmos object.
ka: გამოყოფის შეცდომა CMOS-ის ობიექტის აშენების მცდელობისას.

source: Error trying to raise IO Privilege level.
ka: შეცდომა IO პრივილეგიის დონის აწევის მცდელობისას.

source: The OS Error string was:
ka: ოს-ის შეცდომის სტრიქონი:

source: This message should be localized if setlocale() has been called and gettext compiled in.
ka: ეს შეტყობინება ლოკალურ ენაზე უნდა გამოჩნდეს, თუ setlocale() გამოძახებულია და gettext-ი კი ჩაშენებული.

source: File size is too small: File:
ka: ფაილი ძალიან პატარაა: ფაილი:

source: Could not (re)open file. File:
ka: ფაილის გახსნის შეცდომა. ფაილი:

source: The mmap() call returned mapping of -1 (failure). File:
ka: "mmap()"-ის გამოძახებამ -1 (შეცდომა) დააბრუნა. ფაილი:

source: The OS Error string was:
ka: ოს-ის შეცდომის სტრიქონი:

source: There was an allocation failure while trying to construct the memory object. Filename:
ka: გამოყოფის შეცდომა მეხსიერების ობიექტის აშენების მცდელობისას. ფაილის სახელი:

source: File open error during memory object construction. The filename:
ka: ფაილის გახსნის შეცდომა მეხსიერების ობიექტის აშენებისას. ფაილის სახელი:

source: Allocation error trying to allocate memory for error string. (ironic, yes?)
ka: გამოყოფის შეცდომა შეცდომის სტრიქონისთვის მეხსიერების გამოყოფისას. (ირონიულია, არა?)

source: Could not instantiate SMBIOS table. The errors from the low-level modules were:
ka: SMBIOS-ის ცხრილის წარმოდგენის შეცდომა. დაბალი დონის მოდულებიდან მიღებული შეცდომებია:

source: Failed to find appropriate SMBIOS 0xD4 structure.
ka: შესაბამისი SMBIOS 0xD4 სტრუქტურის პოვნა შეუძლებელია.

source: Failed to allocate memory for error string.
ka: შეცდომის სტრიქონისთვის მეხსიერების გამოყოფის შეცდომა.

source: There was an error trying to perform the smi execute() cmd. Is the 'dcdbas' kernel module loaded?
ka: შეცდომა SMI-ის execute() ბრძანების შესრულებისას. 'dcdbas' მოდული ჩატვირთულია?

source: error reading cmos. Lowlevel returned:
ka: cmos-ის კითხვის შეცდომა. დაბრუნებული მნიშვნელობა:

source: Error trying to read cmos. Lowlevel returned:
ka: შეცდომა CMOS-ის წაკითხვის მცდელობისას. დაბალი დონის შეცდომა:

source: error trying to write cmos. Lowlevel returned:
ka: შეცდომა CMOS-ში ჩაწერის მცდელობისას. დაბალი დონის შეცდომა:

source: Error while trying to write cmos. Lowlevel error was:
ka: შეცდომა CMOS-ში ჩაწერის მცდელობისას. დაბალი დონის შეცდომა:

source: Error trying to set up CMOS checksum routines.
ka: შეცდომა CMOS-ის საკონტროლო ჯამის ქვეპროგრამის მორგებისას.

source: Allocation failure while trying to create token object.
ka: გამოყოფის შეცდომა კოდის ობიექტის შექმნისას.

source: Failed to obtain smbios table.
ka: SMBIOS-ის ცხრილის მიღების შეცდომა.

source: Memory allocation failure allocating error string.
ka: შეცდომის სტრიქონისთვის მეხსიერების გამოყოფის შეცდომა.

source: Error while trying to add 0xD4 tokens.
ka: 0xD4 კოდების დამატების შეცდომა.

source: null pointer returned
ka: დაბრუნებული მაჩვენებელი ნულოვანია

source: function returned error value of zero
ka: ფუნქციის დაბრუნებული კოდის შეცდომის მნიშვნელობა ნულის ტოლია

source: function returned negative error code
ka: ფუნქციის დაბრუნებული შეცდომის კოდის მნიშვნელობა უარყოფითია

source: hit end of table.
ka: ცხრილის დასასრული.

source: No SMBIOS structure found with handle %s
ka: SMBIOS-ის სტრუქტურა დამმუშავებლით "%s" ნაპოვნი არაა

source: No SMBIOS structure found with type %s
ka: SMBIOS-ის სტრუქტურა ტიპით "%s" ნაპოვნი არაა

source: SMI executed but returned error
ka: SMI შესრულდა, მაგრამ შეცდომა დააბრუნა

source: SMI is unsupported
ka: SMI მხარდაუჭერელია

source: SMI did not execute
ka: SMI არ შერულებულა

source: The output buffer the BIOS requires is in the wrong format
ka: BIOS-ის მიერ მოთხოვნილი გამოტანის ბაფერი არასწორ ფორმატშია

source: The output buffer the BIOS requires is too small
ka: BIOS-ის მიერ მოთხოვნილი გამოტანის ბაფერი მეტისმეტად პატარაა

source: Could not determine System ID.
ka: სისტემის ID-ის დადგენა შეუძლებელია.

source: Cannot dereference NULL ID
ka: ნულოვან ID-ისთან მიბმა შეუძლებელია

source: SMBIOS Token ID 0x%04x not found
ka: SMBIOS-ის კოდის ID 0x%04x ვერ ვიპოვე
