Repository: dell/libsmbios
Catalog: po/*.po
Languages: ka

source: Show password information
ka: პაროლის ინფორმაციის ჩვენება

source: Keyboard Scancodes
ka: კლავიატურის კოდები

source: User password
ka: მომხმარებლის პაროლი

source: Admin password
ka: ადმინისტრატორის პაროლი

source: Owner password
ka: მფლობელის პაროლი

source: ERROR: Could not parse system SMBIOS table.
ka: შეცდომა: სისტემის SMBIOS-ის ცხრილების დამუშავების შეცდომა.

source: The smbios library returned this error:
ka: Smbios-ის ბიბლიოთეკამ ეს შეცდომა დააბრუნა:

source: Libsmbios version
ka: Libsmbios -ის ვერსია

source: Product Name
ka: პროდუქტის სახელი

source: Vendor
ka: მომწოდებელი

source: BIOS Version
ka: BIOS-ის ვერსია

source: System ID
ka: სისტემის ID

source: Service Tag
ka: სერვისის ჭდე

source: Express Service Code
ka: ექსპრეს-სერვისის ჯდე

source: Asset Tag
ka: აქტივის ჭდე

source: Property Ownership Tag
ka: საგნის მფლობელობის ჭდე

source: Show or set service tag
ka: სერვისული ჭდის ჩვენება ან დაყენება

source: Show or set asset tag
ka: აქტივის ჭდის ჩვენება ან დაყენება

source: Show or set property tag
ka: საგნის მფლობელობის ჭდის ჩვენება ან დაყენება

source: Set specified tag to new value
ka: მითითებული ჭდის ახალი მნიშვნელობის დაყენება

source: Specify which tag to set.
ka: მიუთითეთ, რომელი ჭდე დავაყენო.

source: Current tag value:
ka: ჭდის მიმდინარე მნიშვნელობა:

source: Setting new tag value: %s
ka: ჭდის ახალი მნიშვნელობის დაყენება: %s

source: Action: dump token table
ka: ქმედება: კოდების ცხრილის დამპი

source: Action: dump token table in CSV format
ka: ქმედება: კოდების ცხრილის დამპი CSV ფორმატში

source: Action: Restore token settings from CSV table dump
ka: ქმედება: კოდის პარამეტრების CSV ცხრილის დამპიდან აღდგენა

source: Action: return true if specified token is a string.
ka: ქმედება: დააბრუნებს 1-ს, თუ მითითებული კოდი სტრიქონია.

source: Action: return true if specified token is a bool.
ka: ქმედება: დააბრუნებს 1-ს, თუ მითითებული კოდი ლოგიკური მნიშვნელობაა.

source: Action: return true if specified bool token is active.
ka: ქმედება: დააბრუნებს 1-ს, თუ მითითებული ლოგიკური კოდი აქტიურია.

source: Action: get string token value.
ka: ქმედება: კოდის მნიშვნელობის სტრიქონის სახით მიღება.

source: Action: activate specified bool token.
ka: ქმედება: მითითებული ლოგიკური მნიშვნელობის მქონე კოდის გააქტიურება.

source: Action: set string token value.
ka: ქმედება: სტრიქონის ტიპის მქონე კოდის მნიშვნელობის დაყენება.

source: Filter only token with ID.
ka: მხოლოდ მითითებული ID-ის მქონე კოდის გაფილტვრა.

source: Filter only token with name.
ka: მხოლოდ მითითებული სახელის მქონე კოდის გაფილტვრა.

source: Filter only token with setting.
ka: მხოლოდ მითითებული პარამეტრის მქონე კოდის გაფილტვრა.

source: path to the token.csv file.
ka: ბილიკი token.csv ფაილამდე.

source: Path to token blacklist file.
ka: ბილკი კოდების შავი სიის ფაილამდე.

source: unknown
ka: უცნობი

source: Ignoring parsing error in CSV file:
ka: CSV ფაილის დამუშავებისას ნაპოვნი შეცდომის იგნორი:

source: Skipping '%s' due to IOError.
ka: '%s'-ის გამოტოვება IOError-ის გამო.

source: The error message was: %s
ka: შეცდომის შეტყობინება: %s

source: <weird unknown type>
ka: <უცნაური უცნობი ტიპი>

source: <unknown value>
ka: <უცნობი მნიშვნელობა>

source: Token: 0x%04x - %s (%s)
ka: კოდი: 0x%04x - %s (%s)

source: value: %s = %s
ka: მნიშვნელობა: %s = %s

source: Desc:
ka: აღწ:

source: Importing token values from '%s'
ka: კოდის მნიშვნელობების შემოტანა '%s' -დან

source: File format error. The first line should list the column names. Could not find the %s column
ka: ფაილის ფორმატის შეცდომა. პირველი ხაზი სვეტების სახელების სია უნდა იყოს. ვერ ვიპოვე სვეტი: %s

source: Cannot continue, exiting.
ka: გაგრძელება შეუძლებელია. მუშაობის დამთავრება.

source: Not importing token that is unknown: 0x%04x
ka: უცნობი კოდის შემოტანა არ მოხდება: 0x%04x

source: INFO: token 0x%04x settings file name does not match my DB. Applying setting anyways.
ka: ინფორმაცია: კოდი 0x%04x პარამეტრების ფაილი ჩემს ბაზას არ ემთხვევა. პარამეტრები მაინც გადატარდება.

source: settings file: %s
ka: პარამეტრების ფაილი: %s

source: DB name : %s
ka: ბაზის სახელი : %s

source: INFO: token 0x%04x settings file setting-name does not match my DB. Applying setting anyways.
ka: ინფორმაცია: კოდი 0x%04x პარამეტრის სახელი ფაილი ჩემს ბაზას არ ემთხვევა. პარამეტრი მაინც გადატარდება.

source: SKIPPING: TYPE MISMATCH. Settings file says token 0x%04x should be bool, but it doesnt pass bool check.
ka: გამოტოვება: ტიპი არ ემთხვევა. პარამეტრების ფაილი იძახის, რომ კოდი 0x%04x ლოგიკურ მნიშვნელობას უნდა წარმოადგენდეს, მაგრამ მის ტესტებს ვერ გადის.

source: Importing setting for token (active): 0x%04x
ka: პარამეტრის შემოტანა კოდისთვის (აქტიური): 0x%04x

source: Token already correct (bool, active): 0x%04x
ka: კოდი უკვე სწორია (ლოგიკური, აქტიური): 0x%04x

source: Info: Cannot de-activate tokens, can only activate the contrapositive. (0x%04x == false)
ka: ინფორმაცია: კოდის დეაქტივაცია შეუძლებელია. შესაძლებელია მხოლოდ საპირისპიროს აქტივაცია (0x%04x == false)

source: Token already correct (bool, inactive): 0x%04x
ka: კოდი უკვე სწორია (ლოგიკური, არააქტიური): 0x%04x

source: UNEXPECTED VALUE: Bool token should only ever have values of 'true' or 'false', but token 0x%04x tries to set value '%s'
ka: მოულოდნელი მნიშვნელობა: ლოგიკური მნიშვნელობის მქონე კოდებს მხოლოდ 'true' (ჭეშმარიტი) ან 'false' (მცდარი) მნიშვნელობები უნდა ჰქონდეთ, მაგრამ კოდი 0x%04x ცდილობს, რომ გამოაგზავნოს '%s'

source: SKIPPING: TYPE MISMATCH. Settings file says token 0x%04x should be string, but it doesnt pass string check.
ka: გამოტოვება: ტიპი არ ემთხვევა. პარამეტრების ფაილი იძახის, რომ კოდი 0x%04x სტრიქონს უნდა წარმოადგენდეს, მაგრამ მის ტესტებს ვერ გადის.

source: Importing setting for token (string): 0x%04x
ka: კოდისთვის (სტრიქონი) პარამეტრის შემოტანა: 0x%04x

source: Token already correct (string=='%s'): 0x%04x
ka: კოდი უკვე სწორია (სტრიქონი =='%s'): 0x%04x

source: Not importing token which is inapplicable to this system: 0x%04x
ka: კოდი, რომელიც შეუსაბამოა ამ სისტემისთვის, შემოტანილი არ იქნება: 0x%04x

source: Not importing blacklisted token 0x%04x. Reason: %s
ka: შავ სიაში მოხვედრილი კოდი 0x%04x შემოტანილი არ იქნება. მიზეზი: %s

source: require token-id or token name/setting pair.
ka: კოდის ID-ს ან კოდის სახელი/პარამეტრის წყვილის მითითება აუცილებელია.

source: token not found. Name(%s) Setting(%s).
ka: კოდი ვერ ვიპოვე. სახელი(%s) პარამეტრი(%s).

source: Original Value
ka: საწყისი მნიშვნელობა

source: token: 0x%04x
ka: კოდი: 0x%04x

source: type: %s
ka: ტიპი: %s

source: value: %s
ka: მნიშვნელობა: %s

source: Setting string value ...
ka: სტრიქონის ტიპის მნიშვნელობის დაყენება ...

source: New value
ka: ახალი მნიშვნელობა

source: Activating token...
ka: კოდის აქტივაცია...

source: ERROR: Could not manipulate system token.
ka: შეცდომა: სისტემის კოდის შეცვლა შეუძლებელია.

source: The token library returned this error:
ka: კოდის ბიბლიოთეკამ ეს შეცდომა დააბრუნა:

source: Set wakeup hour. Must be 0-23
ka: გაღვიძების საათი. 0-23

source: Set wakeup minute. Must be 0-59
ka: გაღვიძებიწ წუთი. 0-59

source: Set wakeup for every day
ka: ყოველ დღე გაღვიძების დაყენება

source: Set wakeup for weekdays only
ka: მხოლოდ სამუშაო დღეებში გაღვიძების დაყენება

source: Disable wakeups
ka: გაღვიძებების გამორთვა

source: Wakeup hour must be between 0 and 23. You passed: '%s'
ka: გაღვიძების საათი 0-სა და 23-ს შორის უნდა იყოს. თქვენ გადაეცით: '%s'

source: Wakeup min must be between 0 and 59. You passed: '%s'
ka: გაღვიძების წუთი 0-სა და 59-ს შორის უნდა იყოს. თქვენ გადაეცით: '%s'

source: Wakeup disabled
ka: გაღვიძება გათიშულია

source: Wakeup every day
ka: გაიღვიძებს ყოველ დღე

source: Wakeup time: %02d:%02d
ka: გაღვიძების დრო: %02d:%02d

source: Wakeup weekdays
ka: კვირის დღეებში გაღვიძება

source: Current wakeup settings:
ka: გაღვიძების მიმდინარე მნიშვნელობა:

source: Setting new wakeup time:
ka: გაღვიძების ახალი მნიშვნელობის დაყენება:

source: ERROR: This system does not support programmed wakeups.
ka: შეცდომა: ამ სისტემას პროგრამირებული გაღვიძების მხარდაჭერა არ გააჩნია.

source: Show wireless configuration (default)
ka: უსადენო მიერთების კონფიგურაციის ჩვენება (ნაგულისხმები)

source: Set BIOS boot-time setting.
ka: BIOS-ის ჩატვირთვის-დროის პარამეტრების დაყენება.

source: Do not set BIOS boot-time setting.
ka: BIOS-ის ჩატვირთვის-დროის პარამეტრები არ დაყენდება.

source: Set BIOS runtime setting (default).
ka: BIOS-ის გაშვების დროს საჭირო პარამეტრის დაყენება (ნაგულისხმები).

source: Do not set BIOS runtime setting.
ka: BIOS-ის გაშვების დროს საჭირო პარამეტრები არ დაყენდება.

source: Set radio runtime status for wireless LAN
ka: უსადენო LAN-ის რადიოს სტატუსის დაყენება

source: Set radio runtime status for Bluetooth
ka: BT-ის რადიოს სტატუსის დაყენება

source: Set radio runtime status for cellular (wireless WAN)
ka: ფიჭურის (უსადენო WAN) რადიოს სტატუსის დაყენება

source: Set radio runtime status for UWB
ka: UWB-ს რადიოს სტატუსის დაყენება

source: Set radio runtime status for WiGig
ka: WiGIg-ის რადიოს სტატუსის დაყენება

source: Set hardware switch so that it controls radio for wireless LAN
ka: დააყენეთ აპარატურული გადამრთველი, რომელიც უსადენო LAN-ის რადიოს აკონტროლებს

source: Set hardware switch so that it controls radio for Bluetooth
ka: დააყენეთ აპარატურული გადამრთველი, რომელიც BT-ის რადიოს აკონტროლებს

source: Set hardware switch so that it controls radio for cellular (wireless WAN)
ka: დააყენეთ აპარატურული გადამრთველი, რომელიც ფიჭურის (უსადენო WAN) რადიოს აკონტროლებს

source: Set hardware switch so that it controls radio for UWB
ka: დააყენეთ აპარატურული გადამრთველი, რომელიც UWB-ის რადიოს აკონტროლებს

source: Set hardware switch so that it controls radio for WiGig
ka: დააყენეთ აპარატურული გადამრთველი, რომელიც WiGig-ის რადიოს აკონტროლებს

source: Enable or disable the WIFI locator switch
ka: WIFI ლოკატორის გადამრთველის ჩართვა ან გამორთვა

source: Get status for wireless LAN. 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
ka: უსადენო LAN-ის სტატუსის მიღება. 0 = ჩართული. 1= გამორთული. 2 = არ არსებობს. 3 = მხარდაუჭერელია. 4 = უცნობი.

source: Get status for Bluetooth. 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
ka: BT-ის სტატუსის მიღება. 0 = ჩართული. 1= გამორთული. 2 = არ არსებობს. 3 = მხარდაუჭერელია. 4 = უცნობი.

source: Get status for cellular (wireless WAN). 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
ka: ფიჭურის (უსადენო WAN) სტატუსის მიღება. 0 = ჩართული. 1= გამორთული. 2 = არ არსებობს. 3 = მხარდაუჭერელია. 4 = უცნობი.

source: Get status for UWB. 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
ka: UWB-ის სტატუსის მიღება. 0 = ჩართული. 1= გამორთული. 2 = არ არსებობს. 3 = მხარდაუჭერელია. 4 = უცნობი.

source: Get status for WiGig. 0 = enabled. 1 = disabled. 2 = not present. 3 = unsupported. 4 = unknown.
ka: WiGig-ის სტატუსის მიღება. 0 = ჩართული. 1= გამორთული. 2 = არ არსებობს. 3 = მხარდაუჭერელია. 4 = უცნობი.

source: Get status for locator switch
ka: ლოკატორის გადამრთველის სტატუსის მიღება

source: Locator
ka: ლოკატორი

source: Set boot settings for %s
ka: %s-ის ჩატვირთვის პარამეტრების დაყენება

source: This system does not support boot time settings for %s
ka: ამ სისტემას %s-ისთვის ჩატვირთვის დროის პარამეტრების მითითების მხარდაჭერა არ გააჩნია

source: Set runtime settings for %s
ka: %s-ის გაშვების დროის პარამეტრების დაყენება

source: Runtime setting has no effect when boot time config is disabled. Ignoring.
ka: გაშვების დროის პარამეტრს ეფექტი არ აქვს, როცა ჩატვირთვის დროის კონფიგურაცია გათიშულია. იგნორირება.

source: This system does not support runtime control of wireless settings.
ka: ამ სისტემას უსადენო ქსელის პარამეტრების გაშვებულ მდგომარეობაში შეცვლის მხარდაჭერა არ გააჩნია.

source: Set boot switch settings for %s
ka: %s-სთვის ჩატვირთვის გადამრთველის პარამეტრის დაყენება

source: This system does not support boot-time wireless switch configuration for %s.
ka: ამ სისტემას %s-სთვის ჩატვირთვის დროს უსადენო ქსელის გადამრთველის მხარდაჭერა არ გააჩნია.

source: Set runtime switch settings for %s
ka: გადამრთველის პარამეტრების დაყენება %s-სთვის

source: This system does not support runtime control of wireless switch settings.
ka: ამ სისტემას უსადენო ქსელის გადამრთველის გაშვებულ მდგომარეობაში კონტროლის მხარდაჭერა არ გააჩნია.

source: Radio Status for %s:
ka: რადიოს სტატუსი %s-სთვის:

source: %s enabled at boot
ka: %s ჩართულია ჩატვირთვისას

source: %s disabled at boot
ka: %s გათიშულია ჩატვირთვისას

source: %s boot-time setting not present
ka: %s ჩატვირთვის-დროის პარამეტრი დაყენებული არაა

source: %s supported
ka: %s მხარდაჭერილია

source: %s disabled
ka: %s გათიშულია

source: %s enabled
ka: %s ჩართულია

source: %s installed
ka: %s დაყენებულია

source: %s not installed
ka: %s დაყენებული არაა

source: %s controlled by wireless switch at boot
ka: %s ჩატვირთვისას უსადენო ქსელის გადამრთველით იმართება

source: %s not controlled by wireless switch at boot
ka: %s ჩატვირთვისას უსადენო ქსელის გადამრთველით არ იმართება

source: %s boot-time wireless switch setting not present
ka: %s -ის ჩატვირთვის დროის უსადენო შეერთების გადამრთველის პარამეტრი არ არსებობს

source: %s runtime switch control currently enabled
ka: %s-ის გაშვების დროს გადამრთველის კონტროლი ამჟამად ჩართულია

source: %s runtime switch control currently disabled
ka: %s-ის გაშვების დროს გადამრთველის კონტროლი ამჟამად გათიშულია

source: %s not supported
ka: %s მხარდაუჭერელია

source: %s legacy switch enabled
ka: %s მოძველებული გადამრთველი ჩართულია

source: %s legacy switch disabled
ka: %s მოძველებული გადამრთველი გამორთულია

source: Status Code: %d
ka: სტატუსის კოდი: %d

source: Wireless Info:
ka: უსადენო მიერთების ინფორმაცია:

source: Hardware switch supported
ka: აპარატურული გადამრთველი მხარდაჭერილია

source: Hardware switch not supported
ka: აპარატურული გადამრთველი მხარდაუჭერელია

source: WiFi Locator supported
ka: WiFi ლოკატორი მხარდაჭერილია

source: WiFi Locator not supported
ka: WiFi ლოკატორი მხარდაუჭერელია

source: Wireless Keyboard supported
ka: უსადენო კლავიატურა მხარდაჭერილია

source: Wireless Keyboard not supported
ka: უსადენო კლავიატურა მხარდაუჭერელია

source: NVRAM Size: %d bytes
ka: NVRAM -ის ზომა: %d ბაიტი

source: NVRAM format version: %d
ka: NVRAM -ის ფორმატის ვერსია: %d

source: Wireless Switch Configuration
ka: უსადენო გადამრთველის მორგება

source: WLAN switch control: %s
ka: WLAN გადამრთველის კონტროლი: %s

source: on
ka: ჩართული

source: off
ka: გამორთული

source: Bluetooth switch control: %s
ka: Bluetooth გადამრთველის კონტროლი: %s

source: WWAN switch control: %s
ka: WWAN გადამრთველის კონტროლი: %s

source: UWB switch control: %s
ka: UWB გადამრთველის კონტროლი: %s

source: WiGig switch control: %s
ka: WiGig გადამრთველის კონტროლი: %s

source: switch config: %s
ka: გადამრთველის პარამეტრები: %s

source: locked
ka: დაბლოკილი

source: not locked
ka: დაბლოკილი არაა

source: WiFi locator: %s
ka: WiFi -ის ლოკატორი: %s

source: enabled
ka: ჩართულია

source: disabled
ka: გამორთულია

source: WiFi Locator config: %s
ka: WiFi -ის ლოკატორის პარამეტრები: %s

source: Libsmbios version : %s
ka: Libsmbios -ის ვერსია : %s

source: smbios-wireless-ctl version : %s
ka: smbios-wireless-ctl -ის ვერსია : %s

source: ERROR: Could not execute SMI.
ka: შეცდომა; SMI-ის შესრულება შეუძლებელია.

source: The smi library returned this error:
ka: SMI ბიბლიოთეკამ ეს შეცდომა დააბრუნა:

source: Set new value
ka: ახალი მნიშვნელობის დაყენება

source: Set new value to be used while running on battery power
ka: დააყენეთ ახალი მნიშვნელობა, რომელიც ელემენტზე მუშაობის დროს გამოიყენება

source: Set new value to be used while running on AC power
ka: დააყენეთ ახალი მნიშვნელობა, რომელიც დამტენზე შეერთების დროს გამოიყენება

source: Reading current %s mode setting
ka: %s-ის მიმდინარე რეჟიმის პარამეტრის წაკითხვა

source: current: %s
ka: მიმდინარე: %s

source: min: %s
ka: მინ: %s

source: max: %s
ka: მაქს: %s

source: Write new %s mode setting
ka: რეჟიმის ახალი %s პარამეტრის ჩაწერა

source: Battery
ka: ელემენტი

source: LCD Brightness is not settable on this machine using this utility.
ka: LCD-ის სიკაშკაშეს ამ მანქანაზე ამ პროგრამით ვერ დააყენებთ.

source: Could not set value because the password was incorrect
ka: მნიშვნელობის დაყენება შეუძლებელია პაროლის სიმცდარის გამო

source: value outside legal bounds
ka: მნიშვნელობა დაშვებულ საზღვრებს გარეთაა

source: This will Display the Supported Features for Keyboard illumination
ka: ეს კლავიატურის განათების მხარდაჭერილ ფუნქციებს აჩვენებს

source: This will Display the current Status of Keyboard Illumination Settings
ka: ეს კლავიატურის განათების პარამეტრების მიმდინარე სტატუსს აჩვენებს

source: Option to set USER Selectable Keyboard Mode
ka: კლავიატურის მომხმარებლის მიერ არჩევადი რეჟიმის დაყენების პარამეტრი

source: Option to set Trigger types for Keyboard Illumination
ka: კლავიატურის განათების ტრიგერის ტიპების დაყენების პარამეტრი

source: Set Keyboard Illumination Timeout Value (battery)
ka: კლავიატურის განათების ვადის მნიშვნელობის დაყენება (ელემენტზე)

source: Set Keyboard Illumination Timeout Value (ac)
ka: კლავიატურის განათების ვადის მნიშვნელობის დაყენება (კვება შეერთებულია)

source: Set Keyboard Illumination Level
ka: კლავიატურის განათების დონის დაყეება

source: Set/Get ALS (Ambient Light Sensor Status and Control Level)
ka: ALS (გარე განათების სენსორის სტატუსის და კონტროლის დონიე) დაყენება/მიღება

source: Get Keyboard Illumination Capability: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X,res[smi.cbRES4]=0x%X
ka: კლავიატურის განათების შესაძლებლობების მიღება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X,res[smi.cbRES4]=0x%X

source: tCould not retrieve supported USER Selectable Modes
ka: მომხმარებლის მიერ არჩევადი რეჟიმების მიღება შეუძლებელია

source: Supported USER Selectable Modes:
ka: მომხმარებლის მიერ არჩევადი მხარდაჭერილი რეჟიმები:

source: Option Mode
ka: მორგების რეჟიმი

source: Note: some modes might need the keyboard set at specific illumination levels
ka: შენიშვნა: ზოგიერთ რეჟიმს შეიძლება კლავიატურის სპეციფიკური დონე დასჭირდეს

source: Could not retrieve supported KeyBoard Illumination Capabilities
ka: კლავიატურის განათების მხარდაჭერილი ფუნქციების მიღების შეცდომა

source: Select Keyboard illumination on:
ka: აირჩიეთ განათება კლავიატურაზე:

source: Trigger Type Option
ka: ტიპის პარამეტრის ტრიგერი

source: Eg: to Select Trigger for [Any Keystroke] and [Touchpad activity] specify your option like this 0,1)
ka: მაგ: [ღილაკების ნებისმიერი მიმდევრობის] და [თაჩპედის აქტივობის] სტრიგერის ასარჩევად მიუთითეთ თქვენი პარამეტრი ასეთ ფორმატში: 0,1)

source: Triggers Validated Successfully
ka: ტრიგერები წარმატებით დადასტურდა

source: _set_keyboard_attr Flag error: %s
ka: _set_keyboard_attr ალმის შეცდომა: %s

source: Get Keyboard illumination Current State: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
ka: კლავიატურის განათების მიმდინარე მდგომარეობის მიღება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Failed to set Keyboard illumination attributes. Could not read the current settings
ka: კლავიატურის განათების ატრიბუტების დაყენების შეცდომა. მიმდინარე პარამეტრების წაკითხვა შეუძლებელია

source: No valid trigger defined
ka: სწორი ტრიგერი აღწერილი არაა

source: A timeout of zero is not supported
ka: ნულოვანი ვადა მხარდაუჭერელია

source: The current mode (Always OFF) might prevent level changes, select a new mode
ka: მიმდინარე რეჟიმს (ყოველთვის გამორთული) შეუძლია დონის შეცვლას ხელი შეუშალოს. აირჩიეთ ახალი რეჟიმი

source: Setting new params in _set_keyboard_attr : Arg2=0x%X Arg3=0x%X
ka: _set_keyboard_attr-ში ახალი პარამეტრების დაყენება : Arg2=0x%X Arg3=0x%X

source: Set Trigger Failed. Failed to write config
ka: ტრიგერის დაყენების შეცდომა. კონფიგურაციის ჩაწერა შეუძლებელია

source: New %s parameter set Successfully
ka: ახალი %s პარამეტრი წარმატებით იქნა დაყენებული

source: Error Return Code : cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X
ka: შეცდომის დაბრუნებული კოდი : cbRES1: 0x%X cbRES2: 0x%X cbRES3: 0x%X

source: Error reading keyboard settings.
ka: კლავიატურის პარამეტრების წაკითხვის შეცდომა.

source: Your Keyboard will illumination on:
ka: თქვენს კლავიატურას განათება ჩართული ექნება:

source: Old Keyboard illumination battery timeout is: %d %s
ka: კლავიატურის განათების ელემენტის მოლოდინის ძველი ვადაა: %d %s

source: Old Keyboard illumination AC timeout is: %d %s
ka: კლავიატურის განათების მოლოდინის დრო დამტენის შეერთებისას: %d %s

source: Invalid Timeout parameters detected
ka: აღმოჩენილია მოლოდინის ვადის არასწორი პარამეტრები

source: Error: Invalid Timeout entry detected
ka: შეცდომა: აღმოჩენილია მოლოდინის ვადის არასწორი ჩანაწერი

source: Timeout value out of range: %d
ka: მოლოდინის დროის მნიშვნელობა დასაშვებ საზღვრებს გარეთაა: %d

source: To set timeout value as 45 seconds enter: 45s
ka: მოლოდინის დროის მნიშვნელობის 45 წამზე დასაყენებლად შეიყვანეთ: 45s

source: You can specify time out values in s[Seconds], m[Minutes], h[hours], d[days]
ka: მნიშვნელობა შეგიძლიათ მიუთითოთ დროის მნიშვნელობი s (წამი), m (წუთი), h (საათი), d (დღე)

source: Timeout value range is 1-63
ka: მოლოდინის ვადის დიაპაზონია 1-63

source: Old Keyboard illumination level is: %d
ka: კლავიატურის განათების ძველი დონე: %d

source: Level setting not supported
ka: დონის დაყენება მხარდაუჭერელია

source: Value out of range, range is 0-%d
ka: მნიშვნელობა დასაშვებ ზღვრებს გარეთაა. დიაპაზონია 0-%d

source: Current status of KeyBoard Illumination setting on your system:
ka: კლავიატურის განათების პარამეტრის მიმდინარე მდგომარეობა თქვენს სისტემაზე:

source: Get Keyboard Illumination Configuration: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X
ka: კლავიატურის განათების კონფიგურაციის მიღება: res[smi.cbRES1]=0x%X,res[smi.cbRES2]=0x%X,res[smi.cbRES3]=0x%X

source: Info: Unable to fetch Keyboard Illumination Configuration information: Feature Not supported on this system
ka: ინფორმაცია: კლავიატურის განათების კონფიგურაციის ინფორმაციის გამოთხოვის შეცდომა: ფუნქცია მხარდაუჭერელია ამ სისტემაზე

source: Error: Detected Invalid Keyboar Illumination mode
ka: შეცდომა: აღმოჩენილია კლავიატურის განათების არასწორი რეჟიმი

source: Failed to read: Ambient Light trigger level
ka: წაკითხვის შეცდომა: გარე განათების ტრიგერის დონე

source: Ambient Light level to trigger automatic keyboard illumination: 0x%X
ka: გარე განათების დონე კლავიატურის განათების ავტომატურად ჩასართავად: 0x%X

source: Last known Ambient Light level to trigger automatic keyboard illumination: 0x%X
ka: კლავიატურის ავტომატური განათების ტრიგერის გარე განათების დონის ბოლო ცნობილი მნიშვნელობაა: 0x%X

source: Your Keyboard may not support Keyboard illumination Feature
ka: თქვენს კლავიატურას შეიძლება განათების ფუნქცია არ გააჩნია

source: Configured mode state:
ka: დაყენებული რეჟიმის მდგომარეობა:

source: Keyboard illumination timeout on battery has been set at: %d %s
ka: კლავიატურის განათების მოლოდინის ვადის ელემენტზე: %d %s

source: Keyboard illumination timeout on AC has been set at: %d %s
ka: კლავიატურის განათების მოლოდინის ვადის დამტენზე: %d %s

source: Current setting of ALS value that turns the light on or off: %d
ka: ALS-ის მიმდინარე მნიშვნელობა, რომელი განათებას ჩართავს და გამორთავს: %d

source: Current ALS Reading : %d
ka: ALS-ის მიმდინარე მნიშვნელობა : %d

source: Current keyboard light level : %d
ka: კლავიატურის განათების მიმდინარე დონე : %d

source: Capabilities of KeyBoard Illumination on your system:
ka: კლავიატურის განათების კონტროლის შესაძლებლობები თქვენს სისტემაში:

source: Warning:: Your Keyboard may not support Keyboard illumination Feature
ka: გაფრთხილება: თქვენს კლავიატურას შეიძლება განათების ფუნქცია არ გააჩნია

source: Supported USER Selectable Modes :
ka: მომხმარებლის მიერ არჩევადი მხარდაჭერილი რეჟიმები :

source: Supported Keyboard illumination type :
ka: კლავიატურის განათების მხარდაჭერილი ტიპი :

source: Supports Keyboard illumination on :
ka: აქვს კლავიატურის განათების მხარდაჭერა :

source: Can configure Keyboard illumination timeout unit in :
ka: შეგიძლიათ დააყენოთ კლავიატურის განათების მოლოდინის ერთეული :
